In [1]:
import pandas as pd
from sklearn.linear_model import LinearRegression

In [8]:
df = pd.read_csv(r'/home/logistic/Downloads/Insurance.csv', encoding='utf-8')

In [9]:
df

   Age  height  weight  Premium
0   25  162.56      70    18000
1   30  172.72      95    38000
2   35  167.64      78    38000
3   40     NaN     110    60000
4   45  157.48      85    70000

In [11]:
mean_height = df.height.mean()

In [12]:
df.height.fillna(mean_height)

0    162.56
1    172.72
2    167.64
3    165.10
4    157.48
Name: height, dtype: float64

In [13]:
df

   Age  height  weight  Premium
0   25  162.56      70    18000
1   30  172.72      95    38000
2   35  167.64      78    38000
3   40     NaN     110    60000
4   45  157.48      85    70000

In [14]:
df.height = df.height.fillna(mean_height)

In [15]:
df

   Age  height  weight  Premium
0   25  162.56      70    18000
1   30  172.72      95    38000
2   35  167.64      78    38000
3   40  165.10     110    60000
4   45  157.48      85    70000

In [ ]:
reg = LinearRegression()